<pad>	0
<s>	0
</s>	0
<unk>	0
▁	-1.67254
e	-2.15686
s	-2.45155
a	-2.88265
n	-2.93232
m	-3.26343
t	-3.31883
r	-3.37471
c	-3.4338
u	-3.57823
l	-3.63393
d	-3.7665
p	-3.82436
f	-4.04067
o	-4.24496
ing	-4.30855
g	-4.47522
ation	-4.69787
ro	-4.86544
P	-4.92522
b	-4.92522
▁tokeniz	-4.92522
wor	-4.9253
od	-5.12693
y	-5.25855
L	-5.25855
tive	-5.25855
▁text	-5.25855
N	-5.25855
form	-5.25862
T	-5.75855
k	-5.75855
w	-6.75803
x	-6.75805
q	-6.75815
z	-6.75825
v	-6.75835
h	-6.75845
A	-6.75855
E	-6.75855
G	-6.75855
I	-6.75855
R	-6.75855
-	-6.75855
B	-6.75855
i	-6.75855
