{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": {
    "type": "NFKC"
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<sep>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          1
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      },
      "<sep>": {
        "id": "<sep>",
        "ids": [
          3
        ],
        "tokens": [
          "<sep>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": null,
    "vocab": [
      [
        "i",
        -2.4537502291883335
      ],
      [
        "a",
        -2.6317134141116982
      ],
      [
        "e",
        -2.8496000038583196
      ],
      [
        "s",
        -2.849600774108663
      ],
      [
        "n",
        -3.0911871202968877
      ],
      [
        "u",
        -3.1174360595403745
      ],
      [
        "o",
        -3.2359949608444913
      ],
      [
        "l",
        -3.2370835625216667
      ],
      [
        "ng",
        -3.282939605236684
      ],
      [
        "r",
        -3.73530643611198
      ],
      [
        "f",
        -3.735790434555689
      ],
      [
        "m",
        -3.7370835624817085
      ],
      [
        "ce",
        -3.737085409511923
      ],
      [
        "pro",
        -3.737568397541185
      ],
      [
        "for",
        -3.738378317127381
      ],
      [
        "at",
        -3.830440394929448
      ],
      [
        "un",
        -3.968601896483209
      ],
      [
        "t",
        -4.529925173644209
      ],
      [
        "g",
        -4.564412463377124
      ],
      [
        "p",
        -4.735847938107504
      ],
      [
        "z",
        -4.737083562521667
      ],
      [
        "d",
        -4.737083562521667
      ],
      [
        "k",
        -4.737083562521667
      ],
      [
        "v",
        -4.737083562521667
      ],
      [
        "L",
        -4.737083562521667
      ],
      [
        "b",
        -4.737083562521667
      ],
      [
        "N",
        -4.737083562521667
      ],
      [
        "h",
        -4.737083562521667
      ],
      [
        "P",
        -4.737083562521667
      ],
      [
        "an",
        -4.988601949809092
      ],
      [
        "c",
        -5.115743256792548
      ],
      [
        "es",
        -5.115743256792548
      ]
    ],
    "byte_fallback": false
  }
}